[
"Have I performed my duties toward God reluctantly or grudgingly?",
"Did I neglect my prayer life? Did I recite my usual prayers?",
"Did I receive Holy Communion in the state of mortal (serious, grave) sin or without the necessary preparation?",
"Did I violate the one-hour Eucharistic fast?",
"Did I fail to mention a grave sin in my previous confession?",
"Did I seriously believe in something superstitious or engage in a superstitious practice (palm-reading, fortune telling or Ouija board, etc.)",
"Did I seriously doubt a matter of Faith?",
"Did I put my faith in danger, without a good reason, by reading a book, pamphlet, or magazine that contains material contrary to Catholic faith or morals?",
"Did I endanger my faith by joining or attending meetings of organizations opposed to the Catholic faith (non-Catholic services, the Communist Party, Freemasonry, New Age cults, or other religions)? Did I take part in one of its activities?",
"Have I committed the sin of sacrilege (profanation of a sacred person, place or thing)?",
"Did I fail to try my best to fulfill the promises and resolutions that I made to God?",
"Did l take the name of God in vain? Did I make use of God's name mockingly, jokingly, angrily, or in any other irreverent manner?",
"Did I make use of the Blessed Virgin Mary's name or another saint's name mockingly, jokingly, angrily, or in any other irreverent manner?",
"Have I been a sponsor in Baptism or participated actively in other ceremonies outside the Catholic Church?",
"Did I tell a lie under oath? Did I break (private or public) vows?",
"Did I use bad language?",
"Did I miss Mass on Sunday or a Holy Day of obligation?",
"Did I fail to dress appropriately for Mass?",
"Have I, without sufficient reason, arrived at Mass so late that I failed to fulfill the Sunday or Holy Day of obligation?",
"Did I allow myself to be distracted during Mass, by not paying attention, looking around out of curiosity, etc.?",
"Did I cause another to be distracted?",
"Have I performed any work or business activity that would inhibit the worship due to God, the joy proper to the Lord's Day or the appropriate relaxation of mind and body on a Sunday or a Holy Day of obligation?",
"Did I fail to generously help the Church in her necessities to the extent that I am able?",
"Did I fail to fast or abstain on a day prescribed by the Church?",
"For parents: Have I neglected to teach my children their prayers, take or send them to church, or give them a Christian education?",
"For parents: Have I given them bad example?",
"For parents: Have I neglected to watch over my children, to monitor their companions, the books they read, the movies and TV shows they watch?",
"For parents: Have I failed to see to it that my children made their First Confession and First Communion?",
"For parents: Have I failed to see to it that my children have received the sacrament of Confirmation?",
"For parents: Did I disobey my parents or lawful superiors in important matters?",
"For Children: Was I obedient toward my parents?",
"For Children: Did I neglect to help my parents when my help was needed?",
"For Children: Did I treat my parents with little affection or respect?",
"For Children: Did I react proudly when I was corrected by my parents?",
"For Children: Did I have a disordered desire for independence?",
"For Children: Did I do my chores?",
"Did I easily get angry or lose my temper?",
"Was I envious or jealous of others?",
"Did I injure or take the life of anyone? Was I ever reckless in driving?",
"Was I an occasion of sin for others by way of conversation, the telling of jokes religiously, racially, or sexually offensive, my way of dressing, inviting somebody to attend certain shows, lending harmful books or magazines, helping someone to steal, etc.? Did I try to repair the scandal done?",
"How many persons did I lead to sin? What sins were involved?",
"Did I neglect my health? Did I attempt to take my life?",
"Did I mutilate myself or another?",
"Did I get drunk or use prohibited drugs?",
"Did I eat or drink more than a sufficient amount, allowing myself to get carried away by gluttony?",
"Did I participate in any form of physical violence?",
"Did I consent to or actively take part in direct sterilization (tubal ligation, vasectomy. etc.)? Do I realize that this will have a permanent effect on my married life and that I will have to answer to God for its consequences?",
"Did I consent to, advise, or actively take part in an abortion? Was I aware that the Church punishes with automatic excommunication (latae sentenciae) those who procure and achieve abortion? Do I realize that this is a very grave crime?",
"Did I cause harm to anyone with my words or actions?",
"Did I desire revenge or harbor enmity, hatred, or ill-feelings when someone offended me?",
"Did I ask pardon whenever I offended anyone?",
"Did I refuse to forgive?",
"Did I insult or offensively tease others?",
"Did I quarrel with one of my brothers or sisters?",
"Did I willfully entertain impure thoughts?",
"Did l consent to evil desires against virtue of purity, even though I may not have carried them out? Were there any circumstances that aggravated the sin: affinity (relationship by marriage), consanguinity (blood relationship), either the married state or the consecration to God of a person involved?",
"Did I engage in impure conversations? Did I start them?",
"Did I look for fun in forms of entertainment that places me in proximate occasions of sin, such as certain dances, movies, shows, or books with immoral contents? Did I frequent houses of ill repute or keep bad company?",
"Did I realize that I may already have been committing a sin by placing myself in a proximate occasion of sin, such as sharing a room with a person I find sexually attractive, or being alone with such a person in circumstances that could lead to sin?",
"Did I fail to take care of those details of modesty and decency that are the safeguard of purity?",
"Did I fail before going to a show or reading a book, to find out its moral implications, so as not to put myself in immediate danger of sinning and in order to avoid distorting my conscience?",
"Did I willfully look at an indecent picture (any form of pornography) or cast immodest look upon myself or another? Did Iwillfully desire to commit such a sin?",
"Did I lead others to sins of impurity or immodesty? What sins?",
"Did I commit ah impure act? By myself, through masturbation (which is objectively a mortal sin)? With someone else? How many times? With someone of the same or opposite sex? Was there any circumstance of relationship (such as affinity) that could have given the sin special gravity? Did this illicit relationship result in pregnancy? Did I do anything to prevent or end that pregnancy?",
"Do I have friendships that are habitual occasions of sexual sins? Am I prepared to end them?",
"In courtship, is true love my fundamental reason for wanting to be with other person? Do I live the constant and cheerful sacrifice of not putting the person I love in danger of sinning? Do I degrade human love by confusing it with selfishness or mere pleasure?",
"Did I engage in acts such as petting, necking, passionate kisses, or prolonged embraces?",
"For the married: Did I, without serious reason, deprive my spouse of the marital right?",
"For the married: Did I claim my own rights in a way, which showed no concernb for my spouse's state of mind or health? Did I betray conjugal fidelity in desire or deed?",
"For the married: Did I take 'the pill' or use any other artificial birth control device (or practice) before or after new life had already been conceived?",
"For the married: Did I without grave reason with the intention of avoiding conception, make use of marriage on only those days when offspring would not likely be engendered?",
"For the married: Did I suggest to another person the use of birth control pills or another artificial method of preventing pregnancy (like condoms)?",
"For the married: Did I have a hand in contributing to the contraceptive mentality by my advice, jokes, or attitudes? (On abortion, contraception, sterilization, etc., see the 5th Commandment)",
"Did I steal? How much money? Or how much was the object worth?",
"Did I give it back, or at least have the intention of doing so?",
"Have I done or caused damage to another person's property? To what extent?",
"Did I harm anyone by deception, fraud or coercion in business contracts or transactions?",
"Did I unnecessarily spend beyond my means? Do I spend too much money because of vanity, or caprice?",
"Did I give alms according to my capacity?",
"Was I envious of my neighbor's goods?",
"Did I neglect to pay my debts?",
"Did I knowingly accept stolen goods?",
"Did I desire to steal?",
"Did I give in to laziness or love of comfort rather than diligentlyworking or studying?",
"Was I greedy? Do I have an excessively materialistic view of life?",
"Did I tell lies? Did I repair any damage that may have resulted as a consequence of this as much as possible?",
"Have I unjustly or rashly accused others?",
"Did I sin by detraction, that is, by telling the faults of another person without necessity? Did I sin by calumny, that is by telling derogatory lies about another person?",
"Did I engage in gossip, backbiting, or tale telling?",
"Did I reveal a secret without due cause?"
]